Repository: 124476/Kanhub
Catalog: kanhub/locale/*/LC_MESSAGES/django.po
Languages: ru

source: homepage
ru: главная

source: repositories
ru: репозитории

source: Enter repository name
ru: Введите название репозитория

source: Enter task name
ru: Введите название задачи

source: The end date must be after the start date.
ru: Дата окончания должна быть позже даты начала.

source: max 150 символов
ru: Макс. 150 символов

source: Monday
ru: Понедельник

source: Tuesday
ru: Вторник

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: Sunday
ru: Воскресенье

source: stats
ru: Статистика

source: users
ru: Пользователи

source: avatar
ru: Аватар

source: username_is_already_taken
ru: Такое имя пользователя уже занято!

source: About
ru: О проекте

source: About Kanhub
ru: О Kanhub

source: A powerful task management platform for repositories and commits
ru: Мощная платформа управления задачами для репозиториев и коммитов

source: What is Kanhub?
ru: Что такое Kanhub?

source: Kanhub is a cutting-edge platform designed to help you manage tasks in your repositories with ease. It allows you to link tasks to specific commits, monitor progress, and collaborate with your team more effectively.
ru: Kanhub — это передовая платформа, призванная помочь вам с легкостью управлять задачами в ваших репозиториях. Она позволяет вам связывать задачи с определенными коммитами, отслеживать прогресс и более эффективно сотрудничать с вашей командой.

source: Whether you're working on a small personal project or a large-scale team repository, Kanhub provides the tools you need to stay organized and productive.
ru: Работаете ли вы над небольшим личным проектом или над большим команднымрепозиторием Kanhub предоставляет инструменты, необходимые для того, чтобы оставаться организованным и продуктивный.

source: Kanhub Overview
ru: Обзор Overview

source: Key Features
ru: Основные характеристики

source: Task Creation
ru: Создание задачи

source: Create tasks with detailed descriptions, deadlines, and tags. Effortlessly assign tasks to repositories and commits.
ru: Создавайте задачи с подробными описаниями, сроками и тегами. Легко назначайте задачи репозиториям и коммитам.

source: Link Tasks to Commits
ru: Связать задачи с коммитами

source: Associate tasks directly with commits to track changes and keep your project organized.
ru: Свяжите задачи напрямую с коммитами, чтобы отслеживать изменения и поддерживать организованность вашего проекта.

source: Progress Tracking
ru: Отслеживание прогресса

source: Easily track task completion and repository progress. Stay on top of deadlines and project milestones.
ru: Легко отслеживайте выполнение задач и ход выполнения репозитория. Будьте в курсе сроков и контрольных точек проекта.

source: How It Works
ru: Как это работает

source: Kanhub is designed to be intuitive and user-friendly. Here's how it works:
ru: Kanhub разработан так, чтобы быть интуитивно понятным и удобным для пользователя. Вот как это работает:

source: Create a new task by providing details such as title, description, deadline, and tags.
ru: Создайте новую задачу, указав такие данные, как название, описание, срок выполнения, и теги.

source: Link the task to specific commits in your repository to track code changes and related work.
ru: Свяжите задачу с определенными коммитами в вашем репозитории, чтобы отслеживать изменения кода и связанную с этим работу.

source: Monitor the progress of your tasks through an easy-to-use dashboard that updates in real-time.
ru: Отслеживайте ход выполнения своих задач с помощью простой в использовании панели инструментов, которая обновляется в режиме реального времени.

source: Why Choose Kanhub?
ru: Почему стоит выбрать Kanhub?

source: Kanhub brings numerous benefits that make it an essential tool for developers and teams working with repositories.
ru: Kanhub обладает многочисленными преимуществами, которые делают его незаменимым инструментом для разработчиков и команд, работающих с репозиториями.

source: Collaboration
ru: Сотрудничество

source: Easily collaborate with team members by assigning tasks, tracking progress, and sharing updates in real-time.
ru: Легко сотрудничайте с членами команды, назначая задачи, отслеживая прогресс и делясь обновлениями в режиме реального времени.

source: Time Efficiency
ru: Эффективное распределение времени

source: Save time by linking tasks directly to commits, reducing the need for manual tracking.
ru: Экономьте время, напрямую связывая задачи с коммитами, сокращая необходимость в ручном отслеживании.

source: Secure & Reliable
ru: Безопасно и надежно

source: Kanhub is built with security and reliability in mind. You can trust the platform to keep your data safe.
ru: Kanhub создан с учетом безопасности и надежности. Вы можете доверять платформе, которая будет хранить ваши данные в безопасности.

source: Get Started
ru: Начать

source: Kanhub API Docs
ru: Документация API Kanhub

source: kanhub_api_docs
ru: Документация API Kanhub

source: preamble
ru: Предисловие

source: Token
ru: Токен

source: creating
ru: создание

source: receiving
ru: получение

source: Repository
ru: Репозиторий

source: update
ru: обновлять

source: deleting
ru: удаление

source: Task
ru: Задача

source: Commits
ru: Коммиты

source: copy
ru: Копировать

source: coped
ru: Скопировано

source: Fetching
ru: Извлечение

source: To fetch the list of commits, send a GET request with the token in headers.
ru: Чтобы получить список коммитов, отправьте GET-запрос с токеном в заголовках.

source: Request Headers:
ru: Заголовки запроса:

source: Response Parameters:
ru: Параметры ответа:

source: The response will include a list of commits with details about each commit.
ru: Ответ будет включать список коммитов с подробностями о каждом коммите.

source: Response Codes:
ru: Коды ответов:

source: Code
ru: Код

source: Description
ru: Описание

source: Successfully fetched commits
ru: Успешно извлеченные коммиты

source: Invalid or missing token
ru: Недействительный или отсутствующий токен

source: No commits found or incorrect URL
ru: Не найдено ни одного коммита или неверный URL

source: Invalid HTTP method
ru: Неверный метод HTTP

source: Example Request to Fetch Commits:
ru: Пример запроса на получение коммитов:

source: Example Response after Fetching Commits:
ru: Пример ответа после получения коммитов:

source: Python Code Example
ru: Пример кода на Python

source: API Preamble
ru: Предисловие к API

source: Basic API Path:
ru: Базовый путь API:

source: API Documentation Version
ru: Версия документации API

source: Welcome to the Datanar API service documentation!
ru: Добро пожаловать в документацию по сервису API Datanar!

source: This API is designed to help you manage repositories, commits, and tasks.
ru: Этот API разработан, чтобы помочь вам управлять репозиториями, коммитами и задачами.

source: It allows you to perform CRUD operations for repositories and tasks related to specific commits.
ru: Он позволяет выполнять операции CRUD для репозиториев и задач, связанных с определенными коммитами.

source: Available API Endpoints
ru: Доступные конечные точки API

source: Repositories
ru: Репозитории

source: List of Repositories
ru: Список репозиториев

source: Repository Details
ru: Подробности репозитория

source: Retrieve a single repository
ru: Получить один репозиторий

source: Tasks
ru: Задачи

source: repository_id
ru: ID репозитория

source: List of Tasks for a Repository
ru: Список задач для репозитория

source: Retrieve a specific task
ru: Получить конкретную задачу

source: List of Commits
ru: Список коммитов

source: Authentication
ru: Аутентификация

source: To use this API, you must authenticate using a token.
ru: Для использования этого API необходимо пройти аутентификацию с использованием токена.

source: You can obtain your token by sending a POST request to /api-token-auth/ with your username and password.
ru: Вы можете получить свой токен, отправив запрос POST на /api-token-auth/ с вашим именем пользователя и паролем.

source: Use the token as the Authorization header in your requests, with the format: Token <your_token>.
ru: Используйте токен в качестве заголовка авторизации в ваших запросах в формате: Токен <your_token>.

source: Additional Information
ru: Дополнительная информация

source: For any questions or support, feel free to reach out to us at the provided contact email.
ru: Если у вас есть вопросы или вам нужна поддержка, обращайтесь к нам по указанному контактному адресу электронной почты.

source: Create/Update
ru: Создать/Обновить

source: To create or update a repository, send a POST request with authentication token in headers and required data in the body.
ru: Чтобы создать или обновить репозиторий, отправьте запрос POST с аутентификацией токеном в заголовках и необходимыми данными в теле.

source: Request Parameters:
ru: Параметры запроса:

source: Attribute Name
ru: Имя атрибута

source: Location
ru: Расположение

source: Type
ru: Тип

source: Required
ru: Необходимый

source: Yes
ru: Да

source: Name of the repository
ru: Название репозитория

source: Text or description of the repository
ru: Текст или описание репозитория

source: Start date of the repository's activity
ru: Дата начала деятельности репозитория

source: End date of the repository's activity
ru: Дата окончания деятельности репозитория

source: Whether the repository is published or not
ru: Опубликован ли репозиторий или нет

source: Headers for Authentication:
ru: Заголовки для аутентификации:

source: Unique identifier for the repository
ru: Уникальный идентификатор репозитория

source: Description or text related to the repository
ru: Описание или текст, относящийся к репозиторию

source: Indicates if the repository is published
ru: Указывает, опубликован ли репозиторий

source: Repository successfully created
ru: Репозиторий успешно создан

source: Repository successfully updated
ru: Репозиторий успешно обновлен

source: Missing required fields
ru: Отсутствуют обязательные поля

source: Example Request for Creating or Updating Repository:
ru: Пример запроса на создание или обновление репозитория:

source: Example Response for Creating or Updating Repository:
ru: Пример ответа для создания или обновления репозитория:

source: Deleting
ru: Удаление

source: To delete a repository, send a DELETE request with the repository ID and the token in headers.
ru: Чтобы удалить репозиторий, отправьте запрос DELETE с идентификатором репозитория и токеном в заголовках.

source: There are no response parameters for a successful deletion.
ru: Параметры ответа для успешного удаления отсутствуют.

source: Repository deleted successfully
ru: Репозиторий успешно удален

source: Repository not found
ru: Репозиторий не найден

source: Example Request to Delete Repository:
ru: Пример запроса на удаление репозитория:

source: Example Response after Deleting Repository:
ru: Пример ответа после удаления репозитория:

source: To fetch repositories, send a GET request with the authentication token in headers.
ru: Чтобы получить репозитории, отправьте запрос GET с токеном аутентификации в заголовках.

source: Successfully fetched the repository details
ru: Успешно получена информация о репозитории

source: Example Request for Fetching Repositories:
ru: Пример запроса на извлечения репозиториев:

source: Example Response for Fetching Repositories:
ru: Пример ответа для извлечения репозиториев:

source: Update
ru: Обновить

source: To update a repository, send a PUT request with authentication token in headers and the new data in the body.
ru: Чтобы обновить репозиторий, отправьте запрос PUT с токеном аутентификации в заголовках и новыми данными в теле.

source: Missing required fields or invalid data
ru: Отсутствуют обязательные поля или неверные данные

source: Example Request for Updating Repository:
ru: Пример запроса на обновление репозитория:

source: Example Response for Updating Repository:
ru: Пример ответа для обновления репозитория:

source: to_create_a_new_task_provide_the_task_data
ru: Для создания новой задачи укажите её данные

source: task_will_be_created_in_specified_repository
ru: Задача будет создана в указанном репозитории

source: request_parameters:
ru: Параметры запроса:

source: attribute_name
ru: Имя атрибута

source: location
ru: расположение

source: type
ru: тип

source: commitment
ru: обязательство

source: description
ru: описание

source: yes
ru: да

source: Name of the task
ru: Название задачи

source: Description of the task
ru: Описание задачи

source: Task start date
ru: Дата начала задачи

source: Task end date
ru: Дата окончания задачи

source: List of tag IDs associated with the task
ru: Список идентификаторов тегов, связанных с задачей

source: response_parameters:
ru: Параметры ответа:

source: ID of the created task
ru: ID созданной задачи

source: response_codes:
ru: Коды ответов:

source: code
ru: Код

source: task_created_successfully
ru: Задача успешно создана

source: invalid_data
ru: Недействительные данные

source: repository_not_found
ru: Репозиторий не найден

source: example_of_request_sent:
ru: Пример отправленного запроса:

source: example_of_response_receive:
ru: Пример получения ответа:

source: python_code_example
ru: Пример кода python

source: to_delete_an_existing_task_use_the_task_id_in_the_url_and_send_a_delete_request
ru: Чтобы удалить существующую задачу, используйте идентификатор задачи в URL-адресе и отправьте запрос на удаление.

source: ID of the task to be deleted
ru: Идентификатор удаляемой задачи

source: Confirmation message indicating the task has been deleted
ru: Подтверждающее сообщение о том, что задача была удалена

source: task_deleted_successfully
ru: Задача удалена успешно

source: task_or_repository_not_found
ru: Запрос или репозиторий не найден

source: To fetch a specific task from a repository, send a GET request with the task ID and repository ID in the URL, and include a valid token in the headers.
ru: Чтобы получить определенную задачу из репозитория, отправьте запрос GET с идентификатором задачи и идентификатором репозитория в URL-адресе, а также включите действительный токен в заголовки.

source: The request does not have body parameters, but you need to include the repository ID and task ID in the URL path.
ru: Запрос не имеет параметров тела, но вам необходимо включить идентификатор репозитория и идентификатор задачи в путь URL.

source: Commitment
ru: Обязательство

source: ID of the repository to which the task belongs
ru: ID репозитория, к которому относится задача

source: ID of the task you want to fetch
ru: ID задачи, которую вы хотите получить

source: The response will contain the details of the requested task.
ru: Ответ будет содержать подробную информацию о запрошенной задаче.

source: The ID of the task
ru: Идентификатор задачи

source: The name of the task
ru: Название задачи

source: The description of the task
ru: Описание задачи

source: The status of the task
ru: Статус задачи

source: The start date of the task
ru: Дата начала задачи

source: The end date of the task
ru: Дата окончания задачи

source: Successfully fetched task details
ru: Подробности задачи успешно получены

source: Repository or task not found
ru: Репозиторий или задача не найдены

source: Example Request to Fetch Task:
ru: Пример запроса на получение задачи:

source: Example Response with Task Details:
ru: Пример ответа с подробностями задачи:

source: updating
ru: обновление

source: to_update_an_existing_task_use_the_task_id_in_the_url_and_provide_the_updated_task_data
ru: Чтобы обновить существующую задачу, используйте идентификатор задачи в URL-адресе и укажите обновленные данные задачи.

source: ID of the updated task
ru: ID обновленной задачи

source: task_updated_successfully
ru: Задача успешно обновлена

source: repository_or_task_not_found
ru: Репозиторий или задача не найден

source: Creating
ru: Создание

source: To start interacting with the extended API, you need a token.
ru: Чтобы начать взаимодействие с расширенным API, вам понадобится токен.

source: Each new POST request recreates the token.
ru: Каждый новый запрос POST воссоздает токен.

source: Username or email
ru: Имя пользователя или почта

source: Password
ru: Пароль

source: Token for interaction with the extended API
ru: Токен для взаимодействия с расширенным API

source: Token successfully obtained
ru: Токен успешно получен

source: Missing required field
ru: Отсутствует обязательное поле

source: Request other than POST
ru: Запрос, отличный от POST

source: Example of Request Sent:
ru: Пример отправленного запроса:

source: Example of Response Received:
ru: Пример полученного ответа:

source: Receiving
ru: Получение

source: On this route, you can create a token or reacquire an existing one.
ru: На этом пути вы можете создать токен или повторно получить существующий.

source: Kanhub - Task Management Platform
ru: Kanhub — платформа управления задачами

source: Welcome to Kanhub
ru: Добро пожаловать в Kanhub

source: A powerful platform for managing tasks across repositories.
ru: Мощная платформа для управления задачами в репозиториях.

source: Create Tasks
ru: Создать задачи

source: Easily create and describe tasks with titles, deadlines, and tags.
ru: Легко создавайте и описывайте задачи с заголовками, сроками и тегами.

source: Link Commits
ru: Ссылка коммиты

source: Connect tasks to specific commits and track changes effortlessly.
ru: Привязывайте задачи к конкретным коммитам и легко отслеживайте изменения.

source: Track Progress
ru: Отслеживать прогресс

source: Monitor task completion and repository progress in one place.
ru: Отслеживайте выполнение задач и ход выполнения репозитория в одном месте.

source: About us
ru: О проекте

source: Kanhub - task management service
ru: Kanhub - сервис управления задачами

source: Home
ru: Главная

source: theme
ru: Тема

source: light
ru: Светлая

source: dark
ru: Тёмная

source: no_user
ru: Нет пользователя

source: my_profile
ru: Мой профиль

source: admin
ru: Панель админа

source: exit
ru: Выход

source: sign_in
ru: Войти

source: Information
ru: Информация

source: History
ru: История

source: Settings
ru: Настройки

source: Calendar
ru: Календарь

source: Stats
ru: Статистика

source: Published
ru: Опубликовано

source: Not published
ru: Не опубликовано

source: Created at:
ru: Создано в:

source: Updated at:
ru: Обновлено в:

source: Signin via Yandex
ru: Войти через Яндекс

source: dont_have_account_yet
ru: Нет аккаунта?

source: create_it
ru: Создай его

source: forgot_password
ru: Забыл пароль

source: Calendar of repositories
ru: Календарь репозиториев

source: Active
ru: Активный

source: This section can display detailed repository information, statistics, graphs, or recent changes.
ru: В этом разделе может отображаться подробная информация о репозитории, статистика, графики или последние изменения.

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Repository History
ru: История репозитория

source: View details
ru: Посмотреть подробности

source: No history is available for this repository yet.
ru: Для этого репозитория пока нет истории.

source: You must be logged in to view this content.
ru: Для просмотра этого контента вам необходимо войти в систему.

source: Repository Tasks
ru: Задачи репозитория

source: Start
ru: Начинать

source: End
ru: Конец

source: No tasks available for this repository yet.
ru: Для этого репозитория пока нет доступных задач.

source: You don't have any repositories
ru: У вас нет репозиториев

source: Please log in to see your repositories.
ru: Пожалуйста, войдите в систему, чтобы увидеть свои репозитории.

source: New Repository
ru: Новый репозиторий

source: Add New Repository
ru: Добавить новый репозиторий

source: Save
ru: Сохранять

source: Back to Repository List
ru: Вернуться к списку репозиториев

source: Save Changes
ru: Сохранить изменения

source: No tasks available.
ru: Нет доступных задач.

source: New Task
ru: Новая задача

source: Add a New Task
ru: Добавить новую задачу

source: Add a New Task for
ru: Добавить новую задачу для

source: Task Name
ru: Название задачи

source: Tags
ru: Теги

source: Task Description
ru: Описание задачи

source: Start Date
ru: Дата начала

source: End Date
ru: Дата окончания

source: Connect Yandex Account
ru: Подключить Яндекс Аккаунт

source: Sign In via Yandex
ru: Войти через Яндекс

source: Connect %(provider)s
ru: Подключить %(provider)s

source: You are about to connect a new third-party account from %(provider)s.
ru: Вы собираетесь подключить новую стороннюю учетную запись от %(provider)s.

source: Sign In via %(provider)s
ru: Войти через %(provider)s

source: You are about to sign in using a third-party account from %(provider)s.
ru: Вы собираетесь войти, используя стороннюю учетную запись от %(provider)s.

source: Continue
ru: Продолжать

source: Signup with Yandex
ru: Зарегистрироваться через Яндекс

source: Sign Up
ru: Зарегистрироваться

source: You are about to use your %(provider_name)s account to login to %(site_name)s. As a final step, please complete the following form:
ru: Вы собираетесь использовать свою учетную запись %(provider_name)s для входа на %(site_name)s. В качестве последнего шага, пожалуйста, заполните следующую форму:

source: email_confirmation
ru: Подтверждение по электронной почте

source: email_confirmation_description
ru: Подтвердите свою электронную почту

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an email address for user %(user_display)s.
ru: Подтвердите, что <a href="mailto:%(email)s">%(email)s</a> является адресом электронной почты пользователя %(user_display)s.

source: Confirm
ru: Подтверждать

source: Unable to confirm %(email)s because it is already confirmed by a different account.
ru: Невозможно подтвердить %(email)s, так как он уже подтвержден другим аккаунтом.

source: This email confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new email confirmation request</a>.
ru: Эта ссылка для подтверждения по электронной почте устарела или недействительна. Пожалуйста, <a href="%(email_url)s">отправьте новый запрос на подтверждение по электронной почте</a>.

source: email_change
ru: Смена почты

source: Email
ru: Электронная почта

source: Re-send Verification
ru: Повторно отправить подтверждение

source: change_email
ru: изменить email

source: Users
ru: Пользователи

source: All is OK
ru: Все в порядке

source: authorization
ru: Авторизация

source: log_in_to_kanhub
ru: Войти в kanhub

source: logout
ru: выйти из системы

source: password_change
ru: Изменить пароль

source: change_password
ru: Изменение пароля

source: password_changed
ru: Пароль изменён

source: your_password_be_success_changed
ru: Ваш пароль был успешно изменен

source: to_main
ru: На главную

source: password_recovery
ru: Восстановление пароля

source: recover
ru: Восстанавление

source: password_recovered
ru: Восстанавление пароля

source: password_reset_completed_success
ru: Пароль успешно сброшен

source: reset
ru: Сброс

source: email_instructions_for_password_recove_sent
ru: Инструкции по восстановлению пароля отправлены по электронной почте

source: My Profile
ru: Мой профиль

source: Delete Avatar
ru: Удалить аватар

source: Change Email
ru: Изменить адрес электронной почты

source: Change Password
ru: Изменить пароль

source: registration
ru: Регистрация

source: greeting
ru: Приветствуем

source: register
ru: Зарегистрироваться
